Revit 2027 API
STLExportOptions.IsValidForMaxEdgeLength Method
 Checks whether the value is allowed (is in the allowed range) for MaxEdgeLength tessellation parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidForMaxEdgeLength(
	double value
)
Public Shared Function IsValidForMaxEdgeLength (
	value As Double
) As Boolean
public:
static bool IsValidForMaxEdgeLength(
	double value
)
static member IsValidForMaxEdgeLength :
        value : float -> bool
Parameters
value Double
 The value to be checked.
Return Value
Boolean
 True if the value is valid for MaxEdgeLength, false otherwise.
See Also
Reference
STLExportOptions Class
Autodesk.Revit.DB Namespace